<?php
$jsonStr = <<< EOF
{"data":{"10":{"aptMap":{"100100401":"特级","100100403":"二级","100100402":"一级","100100404":"三级","100201903":"三级","100201901":"一级","100201902":"二级","100203402":"二级","100203401":"一级","100201101":"一级","100201102":"二级","1002038":"公路交通工程专业承包公路机电工程","1002035":"海洋石油工程专业承包资质","1002034":"核工程专业承包资质","1002037":"特种工程专业承包资质","1002036":"环保工程专业承包资质","100200702":"二级","100200703":"三级","1002031":"水利水电机电安装工程专业承包资质","100202203":"三级","1003001":"城市园林绿化资质","1002033":"输变电工程专业承包资质","100202201":"一级","1002032":"河湖整治工程专业承包资质","100202202":"二级","100200701":"一级","100100502":"一级","100100501":"特级","100201001":"不分等级","1004003":"建筑装饰装修工程设计与施工一体化","1004004":"建筑幕墙工程设计与施工一体化","100100504":"三级","100100503":"二级","100201802":"二级","1004001":"建筑智能化工程设计与施工一体化","100203303":"三级","1004002":"消防设施工程设计与施工一体化","100203302":"二级","100203301":"一级","100201801":"一级","100202101":"一级","100202902":"二级","1004":"设计与施工一体化资质","1003":"园林绿化资质","1002":"施工专业承包资质","1001":"施工总承包资质","100202102":"二级","100202901":"一级","100200601":"一级","100200602":"二级","1002006":"防水防腐保温工程专业承包资质","1002005":"消防设施工程专业承包资质","1002008":"隧道工程专业承包资质","100400103":"三级","100100601":"特级","1002007":"桥梁工程专业承包资质","100400102":"二级","1002002":"起重设备安装工程专业承包资质","1002001":"地基基础工程专业承包资质","1002004":"电子与智能化工程专业承包资质","1002003":"预拌混凝土专业承包资质","100100603":"二级","100100602":"一级","1002009":"钢结构工程专业承包资质","100100604":"三级","100203601":"一级","100201301":"一级","100201302":"二级","100400101":"一级","100203603":"三级","100203602":"二级","100200902":"二级","100200903":"三级","100200901":"一级","100202402":"二级","100200102":"二级","100202401":"一级","100200103":"三级","100200101":"一级","1002028":"通航建筑物工程专业承包资质","1002027":"航道工程专业承包资质","100400203":"三级","100400202":"二级","1002029":"港航设备安装及水上交管工程专业承包资质","100400201":"一级","1002024":"民航空管工程及机场弱电系统工程专业承包资质","1002023":"机场场道工程专业承包资质","1002026":"港口与海岸工程专业承包资质","1002025":"机场目视助航工程专业承包资质","100100702":"一级","100100701":"特级","100100704":"三级","100100703":"二级","1002020":"水工金属结构制作与安装工程专业承包资质","100203502":"二级","100201202":"二级","100203501":"一级","100201203":"三级","1002022":"铁路电气化工程专业承包资质","1002021":"铁路铺轨架梁工程专业承包资质","100201201":"一级","1002017":"公路路基工程专业承包资质","1002016":"公路路面工程专业承包资质","1002019":"铁路电务工程专业承包资质","1002018":"公路交通工程专业承包公路安全设施","100101002":"二级","1002013":"建筑幕墙工程专业承包资质","100101001":"一级","1002012":"建筑机电安装工程专业承包资质","1002015":"城市及道路照明工程专业承包资质","100101003":"三级","1002014":"古建筑工程专业承包资质","100300103":"三级","100300101":"一级","100300102":"二级","100200803":"三级","100200801":"一级","100200802":"二级","100202302":"二级","1002011":"建筑装修装饰工程专业承包资质","1002010":"模板脚手架专业承包资质","100202301":"一级","100400303":"三级","100400302":"二级","100400301":"一级","100100804":"三级","100100801":"特级","100100803":"二级","100100802":"一级","100201503":"三级","100203802":"二级","100201501":"一级","100203801":"一级","100201502":"二级","100101101":"一级","100101103":"三级","100101102":"二级","100200301":"不分等级","100202603":"三级","100202602":"二级","100202601":"一级","100100104":"三级","100400402":"二级","100100103":"二级","100400401":"一级","1001012":"冶金工程施工总承包资质","1001011":"机电工程施工总承包","100100102":"一级","100400403":"三级","100100101":"特级","100100904":"三级","100100903":"二级","100100902":"一级","100100901":"特级","100201401":"一级","1001010":"通信工程施工总承包资质","100201402":"二级","100203701":"不分等级","100201403":"三级","1001005":"水利水电工程施工总承包资质","100101204":"三级","1001004":"港口与航道工程施工总承包资质","100101203":"二级","1001007":"矿山工程施工总承包资质","1001006":"电力工程施工总承包资质","1001001":"建筑工程施工总承包资质","1001003":"铁路工程施工总承包资质","100101202":"一级","1001002":"公路工程施工总承包资质","100101201":"特级","1001009":"市政公用工程施工总承包资质","1001008":"石油化工工程施工总承包资质","100202501":"一级","100200201":"一级","100200202":"二级","100200203":"三级","100202502":"二级","100100203":"二级","100100202":"一级","100100204":"三级","100203201":"一级","100100201":"特级","100201703":"三级","100203203":"三级","100203202":"二级","100201701":"一级","100201702":"二级","100202001":"一级","100202002":"二级","100202803":"三级","100202003":"三级","100202802":"二级","100200502":"二级","100202801":"一级","100200501":"一级","100100302":"一级","100100301":"特级","100100304":"三级","100100303":"二级","100203102":"二级","100203101":"一级","100203103":"三级","100201602":"二级","100201603":"三级","100201601":"一级","100202703":"三级","100202702":"二级","100202701":"一级","100200401":"一级","100200402":"二级"},"personMap":{"100100401":"一级","100100202":"二级","100400302":"乙级","100100601":"一级","100400301":"甲级","1002002":"水安","1002001":"建安","100100201":"一级","1002003":"交安","100100801":"一级","100100602":"二级","100100802":"二级","1011002":"发输变电","1011001":"供配电","1012":"注册化工工程师","100700001":"一级","100700002":"二级","1003004":"危险物品安全","1003005":"其他安全","1003002":"非煤矿矿山安全","1003003":"建筑施工安全","100300402":"危险化学品","100300403":"烟花爆竹","100300401":"民用爆破器材","100600002":"二级","100600001":"一级","100200102":"B级","100200301":"A级","1003001":"煤矿安全","100200103":"C级","100200101":"A级","100200304":"C1级","100200305":"C2级","100200302":"B级","100200303":"C级","100100301":"一级","100100501":"一级","100100102":"二级","1004003":"公路","100300516":"其他","100100101":"一级","100300514":"军工","100300515":"民航","100300512":"电信","100300513":"农业","100100702":"二级","100100701":"一级","100300511":"特种设备","100100901":"一级","1008001":"岩土","1004001":"土建","1004002":"水利","1001010":"机电工程","1001005":"港口与航道工程","1001004":"民航机场工程","1001007":"矿业工程","100300509":"铁路","1001006":"水利水电工程","100101002":"二级","1001001":"建筑工程","100300507":"水利","100101001":"一级","1001003":"铁路工程","100300505":"林业","1001002":"公路工程","100300506":"电力","100300503":"交通","1011":"注册电气工程师","100300504":"消防","100300501":"农业","100300502":"水利","1001009":"通信与广电工程","1001008":"市政公用工程","1008":"注册土木工程师","1009001":"给水排水","1007":"注册结构工程师","1006":"注册建筑师","1009003":"动力","1005":"造价员","1009002":"暖通空调","1004":"造价工程师","1003":"注册安全工程师","1002":"安考证","1001":"注册建造师","100200201":"A级","1005003":"土建","100200202":"B级","1005002":"水利","1005001":"公路","100200203":"C级","1009":"注册公用设备工程师"}}},"msg":"获取成功","status":true,"code":0}
EOF;

function sortByText($a,$b){
    $v1=iconv('utf-8','gbk',$a['text']);
    $v2=iconv('utf-8','gbk',$b['text']);
    return (strcmp($v1,$v2)>0);
}

$arr = json_decode($jsonStr, true);
$zizhiRemote = $arr['data']['10']['aptMap'];
$zizhi = ['subPlaceHolder' => "请选择资质类型", 'subs' => []];
ksort($zizhiRemote);
foreach ($zizhiRemote as $id => $value) {
    if ($id > 1000 && $id < 1999) {
        $zizhi['subs'][$id] = ['text' => $value, 'subs' => [], "subPlaceHolder" => "请选择资质内容"];
    }
    if ($id > 1000000 && $id < 1999999) {
        $parentId = floor($id / 1000);
        $zizhi['subs'][$parentId]['subs'][$id]=['text' => $value, 'subs' => [], "subPlaceHolder" => "请选择资质等级"];
    }
    if ($id > 100000000 && $id < 199999999) {
        $parentId = floor($id / 100);
        $gParentId = floor($parentId / 1000);
        $zizhi['subs'][$gParentId]['subs'][$parentId]['subs'][$id]=['text' => $value];
    }
}
foreach ($zizhi['subs'] as &$value1) {
    foreach ($value1['subs'] as &$value2) {
        // if(count($value2['subs'])==0){
        //     $value2['subs']=[];
        // }
        $value2['subs']=array_values($value2['subs']);
        // usort($value2['subs'], 'sortByText');
    }
    $value1['subs']=array_values($value1['subs']);
    usort($value1['subs'], 'sortByText');
}
$zizhi['subs']=array_values($zizhi['subs']);

$personRemote = $arr['data']['10']['personMap'];
$person = ['subPlaceHolder' => "请选择人员类型", 'subs' => []];
ksort($personRemote);
foreach ($personRemote as $id => $value) {
    if ($id > 1000 && $id < 1999) {
        $person['subs'][$id] = ['text' => $value, 'subs' => [], "subPlaceHolder" => "请选人员专业"];
    }
    if ($id > 1000000 && $id < 1999999) {
        $parentId = floor($id / 1000);
        $person['subs'][$parentId]['subs'][$id]=['text' => $value, 'subs' => [], "subPlaceHolder" => "请选择人员等级"];
    }
    if ($id > 100000000 && $id < 199999999) {
        $parentId = floor($id / 100);
        $gParentId = floor($parentId / 1000);
        $person['subs'][$gParentId]['subs'][$parentId]['subs'][$id]=['text' => $value];
    }
}
foreach ($person['subs'] as &$value1) {
    foreach ($value1['subs'] as &$value2) {
        // if(count($value2['subs'])==0){
        //     $value2['subs'][]=["text"=>"不分等级"];
        // }
        $value2['subs']=array_values($value2['subs']);
        // usort($value2['subs'], 'sortByText');ss
    }
    $value1['subs']=array_values($value1['subs']);
    usort($value1['subs'], 'sortByText');
}
$person['subs']=array_values($person['subs']);
// usort($zizhi['subs'], 'sortByText');
$conditionOptions=['zizhi'=>$zizhi,'person'=>$person];
print_r(json_encode($conditionOptions));exit;
